#pragma once

// Bloodhunt (1.X) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ABP_Player_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_Player.ABP_Player_C
// 0x316E0 (0x31FB0 - 0x08D0)
class UABP_Player_C : public UTigerPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x08D0(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_DuplicateTransient)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_56;                          // 0x08D8(0x0158)
	struct FAnimNode_MakeDynamicAdditive               AnimGraphNode_MakeDynamicAdditive_9;                      // 0x0A30(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_34;                           // 0x0A68(0x00C8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_39;                                    // 0x0B30(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_38;                                    // 0x0B78(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_66;                        // 0x0BC0(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_55;                          // 0x0C80(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_146;                          // 0x0DD8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_54;                          // 0x0E00(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_145;                          // 0x0F58(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_53;                          // 0x0F80(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_144;                          // 0x10D8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_143;                          // 0x1100(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_65;                        // 0x1128(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_142;                          // 0x11E8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_93;                         // 0x1210(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_92;                         // 0x12B0(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_64;                        // 0x1350(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_52;                          // 0x1410(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_141;                          // 0x1568(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_140;                          // 0x1590(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_139;                          // 0x15B8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_138;                          // 0x15E0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_137;                          // 0x1608(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_136;                          // 0x1630(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_135;                          // 0x1658(0x0028)
	struct FAnimNode_Root                              AnimGraphNode_Root_11;                                    // 0x1680(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_8;                          // 0x16B0(0x0118)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_177;                             // 0x17C8(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_52;                   // 0x18D0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_52;                   // 0x18F0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_176;                             // 0x1910(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_175;                             // 0x1A18(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_174;                             // 0x1B20(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_173;                             // 0x1C28(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_172;                             // 0x1D30(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_Root_10;                                    // 0x1E38(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_7;                          // 0x1E68(0x0118)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_51;                          // 0x1F80(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_91;                         // 0x20D8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_134;                          // 0x2178(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_133;                          // 0x21A0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_50;                          // 0x21C8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_132;                          // 0x2320(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_37;                                    // 0x2348(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_36;                                    // 0x2390(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_35;                                    // 0x23D8(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_Root_9;                                     // 0x2420(0x0030)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_34;                                    // 0x2450(0x0048)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_6;                          // 0x2498(0x0118)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_49;                          // 0x25B0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_131;                          // 0x2708(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_48;                          // 0x2730(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_90;                         // 0x2888(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_5;                 // 0x2928(0x0190)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_89;                         // 0x2AB8(0x00A0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_25;                             // 0x2B58(0x00C8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_63;                        // 0x2C20(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_62;                        // 0x2CE0(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_130;                          // 0x2DA0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_129;                          // 0x2DC8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_128;                          // 0x2DF0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_127;                          // 0x2E18(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_126;                          // 0x2E40(0x0028)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_8;                          // 0x2E68(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_125;                          // 0x2F18(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_124;                          // 0x2F40(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_4;                 // 0x2F68(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_61;                        // 0x30F8(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_47;                          // 0x31B8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_123;                          // 0x3310(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_46;                          // 0x3338(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_122;                          // 0x3490(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_121;                          // 0x34B8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_120;                          // 0x34E0(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_3;                 // 0x3508(0x0190)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_45;                          // 0x3698(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_119;                          // 0x37F0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_118;                          // 0x3818(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_88;                         // 0x3840(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_184;                       // 0x38E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_183;                       // 0x3908(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_182;                       // 0x3930(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_181;                       // 0x3958(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_180;                       // 0x3980(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_141;                         // 0x39A8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_82;                             // 0x3A28(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_140;                         // 0x3A58(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_81;                             // 0x3AD8(0x0030)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_80;                             // 0x3B08(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_20;                            // 0x3B38(0x00B0)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_14;                  // 0x3BE8(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_117;                          // 0x3CB8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_116;                          // 0x3CE0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_87;                         // 0x3D08(0x00A0)
	struct FAnimNode_MakeDynamicAdditive               AnimGraphNode_MakeDynamicAdditive_8;                      // 0x3DA8(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_33;                           // 0x3DE0(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_115;                          // 0x3EA8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_114;                          // 0x3ED0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_113;                          // 0x3EF8(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_33;                                    // 0x3F20(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_44;                          // 0x3F68(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_112;                          // 0x40C0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_60;                        // 0x40E8(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_43;                          // 0x41A8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_111;                          // 0x4300(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_2;                 // 0x4328(0x0190)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_86;                         // 0x44B8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_110;                          // 0x4558(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_109;                          // 0x4580(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_59;                        // 0x45A8(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_85;                         // 0x4668(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_108;                          // 0x4708(0x0028)
	struct FAnimNode_Root                              AnimGraphNode_Root_8;                                     // 0x4730(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_32;                           // 0x4760(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_139;                         // 0x4828(0x0080)
	struct FAnimNode_PoseBlendNode                     AnimGraphNode_PoseBlendNode;                              // 0x48A8(0x00A0)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_5;                          // 0x4948(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_138;                         // 0x4A60(0x0080)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_24;                             // 0x4AE0(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_137;                         // 0x4BA8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_136;                         // 0x4C28(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_135;                         // 0x4CA8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_134;                         // 0x4D28(0x0080)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_23;                             // 0x4DA8(0x00C8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_22;                             // 0x4E70(0x00C8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_21;                             // 0x4F38(0x00C8)
	struct FAnimNode_Root                              AnimGraphNode_Root_7;                                     // 0x5000(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_179;                       // 0x5030(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_178;                       // 0x5058(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_177;                       // 0x5080(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_176;                       // 0x50A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_175;                       // 0x50D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_174;                       // 0x50F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_173;                       // 0x5120(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_172;                       // 0x5148(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_171;                       // 0x5170(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_170;                       // 0x5198(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_169;                       // 0x51C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_168;                       // 0x51E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_167;                       // 0x5210(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_166;                       // 0x5238(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_165;                       // 0x5260(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_164;                       // 0x5288(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_133;                         // 0x52B0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_79;                             // 0x5330(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_132;                         // 0x5360(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_78;                             // 0x53E0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_131;                         // 0x5410(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_77;                             // 0x5490(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_93;                        // 0x54C0(0x00E8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_76;                             // 0x55A8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_130;                         // 0x55D8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_75;                             // 0x5658(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_129;                         // 0x5688(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_84;                         // 0x5708(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_128;                         // 0x57A8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_74;                             // 0x5828(0x0030)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_51;                   // 0x5858(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_51;                   // 0x5878(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_171;                             // 0x5898(0x0108)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_92;                        // 0x59A0(0x00E8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_73;                             // 0x5A88(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_19;                            // 0x5AB8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_127;                         // 0x5B68(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_83;                         // 0x5BE8(0x00A0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_38;                          // 0x5C88(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_58;                        // 0x5D28(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_42;                          // 0x5DE8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_107;                          // 0x5F40(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_106;                          // 0x5F68(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_32;                                    // 0x5F90(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_Root_6;                                     // 0x5FD8(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_4;                          // 0x6008(0x0118)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_31;                                    // 0x6120(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_57;                        // 0x6168(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_105;                          // 0x6228(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_82;                         // 0x6250(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_41;                          // 0x62F0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_104;                          // 0x6448(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_103;                          // 0x6470(0x0028)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_20;                             // 0x6498(0x00C8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_40;                          // 0x6560(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_102;                          // 0x66B8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_101;                          // 0x66E0(0x0028)
	struct FAnimNode_Root                              AnimGraphNode_Root_5;                                     // 0x6708(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_3;                          // 0x6738(0x0118)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_30;                                    // 0x6850(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_56;                        // 0x6898(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_39;                          // 0x6958(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_100;                          // 0x6AB0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_38;                          // 0x6AD8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_99;                           // 0x6C30(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_98;                           // 0x6C58(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_97;                           // 0x6C80(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_81;                         // 0x6CA8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_55;                        // 0x6D48(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_96;                           // 0x6E08(0x0028)
	struct FAnimNode_Root                              AnimGraphNode_Root_4;                                     // 0x6E30(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_2;                          // 0x6E60(0x0118)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_37;                          // 0x6F78(0x0158)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_29;                                    // 0x70D0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_95;                           // 0x7118(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_36;                          // 0x7140(0x0158)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7;                          // 0x7298(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6;                          // 0x7348(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_5;                          // 0x73F8(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_4;                          // 0x74A8(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3;                          // 0x7558(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_94;                           // 0x7608(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_93;                           // 0x7630(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_92;                           // 0x7658(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_91;                           // 0x7680(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_90;                           // 0x76A8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_89;                           // 0x76D0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_88;                           // 0x76F8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_87;                           // 0x7720(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_170;                             // 0x7748(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_50;                   // 0x7850(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_50;                   // 0x7870(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_169;                             // 0x7890(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_168;                             // 0x7998(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_167;                             // 0x7AA0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_166;                             // 0x7BA8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_165;                             // 0x7CB0(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_80;                         // 0x7DB8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_86;                           // 0x7E58(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_85;                           // 0x7E80(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_54;                        // 0x7EA8(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_35;                          // 0x7F68(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_84;                           // 0x80C0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_34;                          // 0x80E8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_83;                           // 0x8240(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_82;                           // 0x8268(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_81;                           // 0x8290(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_80;                           // 0x82B8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_79;                           // 0x82E0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_33;                          // 0x8308(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_78;                           // 0x8460(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_77;                           // 0x8488(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_79;                         // 0x84B0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_76;                           // 0x8550(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_75;                           // 0x8578(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_53;                        // 0x85A0(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_32;                          // 0x8660(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_74;                           // 0x87B8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_73;                           // 0x87E0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_72;                           // 0x8808(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_28;                                    // 0x8830(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_71;                           // 0x8878(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_31;                          // 0x88A0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_70;                           // 0x89F8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_69;                           // 0x8A20(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_78;                         // 0x8A48(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace;                   // 0x8AE8(0x0190)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_30;                          // 0x8C78(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_68;                           // 0x8DD0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_67;                           // 0x8DF8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_77;                         // 0x8E20(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_76;                         // 0x8EC0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_66;                           // 0x8F60(0x0028)
	struct FAnimNode_Root                              AnimGraphNode_Root_3;                                     // 0x8F88(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose;                            // 0x8FB8(0x0118)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_29;                          // 0x90D0(0x0158)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_27;                                    // 0x9228(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_26;                                    // 0x9270(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_75;                         // 0x92B8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_52;                        // 0x9358(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_28;                          // 0x9418(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_27;                          // 0x9570(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_74;                         // 0x96C8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_73;                         // 0x9768(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_65;                           // 0x9808(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_64;                           // 0x9830(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_63;                           // 0x9858(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_62;                           // 0x9880(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_51;                        // 0x98A8(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_72;                         // 0x9968(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_50;                        // 0x9A08(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_71;                         // 0x9AC8(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_163;                       // 0x9B68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_162;                       // 0x9B90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_161;                       // 0x9BB8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_126;                         // 0x9BE0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_72;                             // 0x9C60(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_125;                         // 0x9C90(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_71;                             // 0x9D10(0x0030)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_70;                             // 0x9D40(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_18;                            // 0x9D70(0x00B0)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_13;                  // 0x9E20(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_26;                          // 0x9EF0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_61;                           // 0xA048(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_60;                           // 0xA070(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_25;                                    // 0xA098(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_24;                                    // 0xA0E0(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_31;                           // 0xA128(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_124;                         // 0xA1F0(0x0080)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_59;                           // 0xA270(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_58;                           // 0xA298(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_57;                           // 0xA2C0(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_23;                                    // 0xA2E8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_49;                        // 0xA330(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_25;                          // 0xA3F0(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_24;                          // 0xA548(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_70;                         // 0xA6A0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_56;                           // 0xA740(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_55;                           // 0xA768(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_54;                           // 0xA790(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_53;                           // 0xA7B8(0x0028)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_12;                  // 0xA7E0(0x00D0)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_11;                  // 0xA8B0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_123;                         // 0xA980(0x0080)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_23;                          // 0xAA00(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_52;                           // 0xAB58(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_51;                           // 0xAB80(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_50;                           // 0xABA8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_49;                           // 0xABD0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_22;                          // 0xABF8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_48;                           // 0xAD50(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_47;                           // 0xAD78(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_48;                        // 0xADA0(0x00C0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_10;                       // 0xAE60(0x0050)
	struct FAnimNode_MakeDynamicAdditive               AnimGraphNode_MakeDynamicAdditive_7;                      // 0xAEB0(0x0038)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9;                        // 0xAEE8(0x0050)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_10;                  // 0xAF38(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_69;                         // 0xB008(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8;                        // 0xB0A8(0x0050)
	struct FAnimNode_MakeDynamicAdditive               AnimGraphNode_MakeDynamicAdditive_6;                      // 0xB0F8(0x0038)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_7;                        // 0xB130(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_21;                          // 0xB180(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_46;                           // 0xB2D8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_68;                         // 0xB300(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_45;                           // 0xB3A0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_44;                           // 0xB3C8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_43;                           // 0xB3F0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_47;                        // 0xB418(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_67;                         // 0xB4D8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_46;                        // 0xB578(0x00C0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_19;                             // 0xB638(0x00C8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_20;                          // 0xB700(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_42;                           // 0xB858(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_41;                           // 0xB880(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_22;                                    // 0xB8A8(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_21;                                    // 0xB8F0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_122;                         // 0xB938(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_121;                         // 0xB9B8(0x0080)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_49;                   // 0xBA38(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_49;                   // 0xBA58(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_164;                             // 0xBA78(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_163;                             // 0xBB80(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_162;                             // 0xBC88(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_161;                             // 0xBD90(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_160;                             // 0xBE98(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_159;                             // 0xBFA0(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_66;                         // 0xC0A8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_69;                             // 0xC148(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_17;                            // 0xC178(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_40;                           // 0xC228(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_19;                          // 0xC250(0x0158)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_91;                        // 0xC3A8(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_90;                        // 0xC490(0x00E8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_65;                         // 0xC578(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_89;                        // 0xC618(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_88;                        // 0xC700(0x00E8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_64;                         // 0xC7E8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_63;                         // 0xC888(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_68;                             // 0xC928(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_16;                            // 0xC958(0x00B0)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_9;                   // 0xCA08(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_62;                         // 0xCAD8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_120;                         // 0xCB78(0x0080)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_39;                           // 0xCBF8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_38;                           // 0xCC20(0x0028)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_18;                             // 0xCC48(0x00C8)
	struct FAnimNode_Root                              AnimGraphNode_Root_2;                                     // 0xCD10(0x0030)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_48;                   // 0xCD40(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_158;                             // 0xCD60(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_157;                             // 0xCE68(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_156;                             // 0xCF70(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_48;                   // 0xD078(0x0020)
	unsigned char                                      UnknownData00[0x8];                                       // 0xD098(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_18;                               // 0xD0A0(0x01E0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_17;                               // 0xD280(0x01E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_155;                             // 0xD460(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_154;                             // 0xD568(0x0108)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_18;                          // 0xD670(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_61;                         // 0xD7C8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_37;                           // 0xD868(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_36;                           // 0xD890(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_160;                       // 0xD8B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_159;                       // 0xD8E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_158;                       // 0xD908(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_67;                             // 0xD930(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_87;                        // 0xD960(0x00E8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_60;                         // 0xDA48(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_86;                        // 0xDAE8(0x00E8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_66;                             // 0xDBD0(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_85;                        // 0xDC00(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_84;                        // 0xDCE8(0x00E8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_59;                         // 0xDDD0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_65;                             // 0xDE70(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_15;                            // 0xDEA0(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_17;                          // 0xDF50(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_35;                           // 0xE0A8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_16;                          // 0xE0D0(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_58;                         // 0xE228(0x00A0)
	struct FAnimNode_PoseSnapshot                      AnimGraphNode_PoseSnapshot;                               // 0xE2C8(0x0090)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_57;                         // 0xE358(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_45;                        // 0xE3F8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_119;                         // 0xE4B8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_118;                         // 0xE538(0x0080)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_34;                           // 0xE5B8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_44;                        // 0xE5E0(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_15;                          // 0xE6A0(0x0158)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_20;                                    // 0xE7F8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_33;                           // 0xE840(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_56;                         // 0xE868(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_153;                             // 0xE908(0x0108)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_37;                          // 0xEA10(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_152;                             // 0xEAB0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_151;                             // 0xEBB8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_150;                             // 0xECC0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_149;                             // 0xEDC8(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_47;                   // 0xEED0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_148;                             // 0xEEF0(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_47;                   // 0xEFF8(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_14;                          // 0xF018(0x0158)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_17;                             // 0xF170(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_32;                           // 0xF238(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_31;                           // 0xF260(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_19;                                    // 0xF288(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_13;                          // 0xF2D0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_30;                           // 0xF428(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_29;                           // 0xF450(0x0028)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_36;                          // 0xF478(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_18;                                    // 0xF518(0x0048)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_16;                               // 0xF560(0x01E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_147;                             // 0xF740(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_46;                   // 0xF848(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_46;                   // 0xF868(0x0020)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_17;                                    // 0xF888(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_146;                             // 0xF8D0(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_45;                   // 0xF9D8(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_12;                          // 0xF9F8(0x0158)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_45;                   // 0xFB50(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_145;                             // 0xFB70(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_144;                             // 0xFC78(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_143;                             // 0xFD80(0x0108)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_11;                          // 0xFE88(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_28;                           // 0xFFE0(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_142;                             // 0x10008(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_55;                         // 0x10110(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_10;                          // 0x101B0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_27;                           // 0x10308(0x0028)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_15;                               // 0x10330(0x01E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_141;                             // 0x10510(0x0108)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_43;                        // 0x10618(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_117;                         // 0x106D8(0x0080)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_42;                        // 0x10758(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_26;                           // 0x10818(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_16;                                    // 0x10840(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_140;                             // 0x10888(0x0108)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_15;                                    // 0x10990(0x0048)
